app/controllers/addresses_controller.rb

SELECT * FROM `addresses` WHERE (`addresses`.`users_id` IS NULL) LIMIT 1
---
  def index
    @addresses = Address.findByUser(session[:user][:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def show
    :index
=begin
    @address = Address.find(params[:user][:id])

SELECT * FROM `addresses` WHERE (`addresses`.`id` = 21)
---
  def edit
    @address = Address.find(params[:id])

INSERT INTO `addresses` (`users_id`, `address`, `encrypted_password`) VALUES(6, 'jorgech3@gmail.com', 'HeapAlloc8192_se')
---
  def create
    @address = Address.new(params[:address])

   # respond_to do |format|
      if @address.save

SELECT * FROM `addresses` WHERE (`addresses`.`id` = 21)
UPDATE `addresses` SET `address` = 'wcksTHV1dXULOECCoSIttGMNgZStZ6rvEUZIa+pM', `encrypted_password` = 'wcksTHd3d3cYAMBs' WHERE `id` = 21
---
  def update
    @address = Address.find(params[:id])

    #respond_to do |format|
      if @address.update_attributes(params[:address])

SELECT * FROM `addresses` WHERE (`addresses`.`id` = 15)
DELETE FROM `addresses` WHERE `id` = 15
---
  def destroy
    @address = Address.find(params[:id])
    @address.destroy