app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`username` = 'jorgeche') LIMIT 1
---
  def begin_login_process
    if user = User.findByUsername(params[:user][:username])

SELECT * FROM `users` WHERE (`users`.`username` = 'jorgeche') LIMIT 1
---
  def end_login_process
    if params[:username] == params[:decrypted_username] && @user = User.findByUsername(params[:username])

INSERT INTO `users` (`username`, `lastname`, `encrypted_username`, `firstname`) VALUES('jorgeche', 'Eremiev', '', 'Jorge')
---
  def create
    @user = User.new(params[:user])

    #respond_to do |format|
      if @user.save